#Напишите программу, которая выводит число в стиле LCD калькулятора.
#На вход программе подаётся последовательность цифр, которую нужно вывести на экран в специальном стиле (см. пример).
#Размер всех цифр 4 символа в ширину и 7 символов в высоту. Между цифрами в выводе должен быть один пустой столбец.
# Перед первой цифрой не должно быть пробелов.
#Выведенные цифры должны быть обведены рамочкой, в углах которой находится символ x ("икс"),
# горизонтальная линия создаётся из символа - ("дефис"), а вертикальная -- из символа вертикальной черты: |.
#Формат ввода:
#Строка произвольной длины (минимум один символ), содержащая последовательность цифр.
#Формат вывода:
#9 строк, содержащих цифры, записанные в указанном в задании формате.

#Sample Input:
#0123456789
#Sample Output:
#x-------------------------------------------------x
#| --        --   --        --   --   --   --   -- |
#||  |    |    |    | |  | |    |       | |  | |  ||
#||  |    |    |    | |  | |    |       | |  | |  ||
#|           --   --   --   --   --        --   -- |
#||  |    | |       |    |    | |  |    | |  |    ||
#||  |    | |       |    |    | |  |    | |  |    ||
#| --        --   --        --   --        --   -- |
#x-------------------------------------------------x

def xline():
    global i
    print("x", end="")
    for i in range(len(a) * 5):
        print("-", end="")
    print("x")

a=tuple(input())
#print(a)

c0 = (" -- ", "|  |", "|  |", "    ", "|  |", "|  |", " -- ")
c1 = ("    ", "   |", "   |", "    ", "   |", "   |", "    ")
c2 = (" -- ", "   |", "   |", " -- ", "|   ", "|   ", " -- ")
c3 = (" -- ", "   |", "   |", " -- ", "   |", "   |", " -- ")
c4 = ("    ", "|  |", "|  |", " -- ", "   |", "   |", "    ")
c5 = (" -- ", "|   ", "|   ", " -- ", "   |", "   |", " -- ")
c6 = (" -- ", "|   ", "|   ", " -- ", "|  |", "|  |", " -- ")
c7 = (" -- ", "   |", "   |", "    ", "   |", "   |", "    ")
c8 = (" -- ", "|  |", "|  |", " -- ", "|  |", "|  |", " -- ")
c9 = (" -- ", "|  |", "|  |", " -- ", "   |", "   |", " -- ")

indcat = {0: c0, 1: c1, 2: c2, 3: c3, 4: c4, 5: c5, 6: c6, 7: c7, 8: c8, 9: c9}

xline()

for i in range(7):
    print("|", end="")
    for j in a:
        print(indcat[int(j)][i], end=" ")
    print("|")

xline()